Repository: Kavish-Malik/WaterWise-Karnal
Catalog: members/locale/*/LC_MESSAGES/django.po
Languages: hi

source: Main Logo
hi: मुख्य लोगो

source: WaterWise Karnal
hi: वॉटरवाइज करनाल

source: Dashboard
hi: डैशबोर्ड

source: Rainwater Harvesting
hi: वर्षा जल संचयन

source: Show Notifications
hi: सूचनाएँ दिखाएँ

source: WaterWise Subsidies & Weather Alerts
hi: वॉटरवाइज सब्सिडी और मौसम चेतावनी

source: Micro-Irrigation Subsidies (Drip & Sprinkler)
hi: सूक्ष्म सिंचाई सब्सिडी (ड्रिप और स्प्रिंकलर)

source: UP govt provides <strong>65–90%% subsidy</strong> on micro-irrigation systems for farmers. Apply now to save water & money.
hi: उत्तर प्रदेश सरकार किसानों को सूक्ष्म सिंचाई प्रणालियों पर <strong>65–90%% सब्सिडी</strong> देती है। पानी और पैसे बचाने के लिए अभी आवेदन करें।

source: Apply Now
hi: अभी आवेदन करें

source: Solar-Powered Pump Subsidy (PM-KUSUM)
hi: सौर ऊर्जा चालित पंप सब्सिडी (पीएम-कुसुम)

source: Central Govt’s PM-KUSUM scheme offers massive subsidies for farmers to install solar-powered irrigation pumps.
hi: केंद्रीय सरकार की पीएम-कुसुम योजना किसानों को सौर ऊर्जा चालित सिंचाई पंप लगाने के लिए भारी सब्सिडी प्रदान करती है।

source: Know More
hi: और जानें

source: IMD Rain Alert
hi: आईएमडी वर्षा चेतावनी

source: Fetching latest rainfall advisory...
hi: नवीनतम वर्षा परामर्श प्राप्त किया जा रहा है...

source: IMD Website
hi: आईएमडी वेबसाइट

source: District
hi: जिला

source: Karnal
hi: करनाल

source: Type
hi: प्रकार

source: Select Type
hi: प्रकार चुनें

source: Village
hi: गाँव

source: Town
hi: कस्बा

source: Place
hi: स्थान

source: Select Place
hi: स्थान चुनें

source: Save & Continue
hi: सहेजें और जारी रखें

source: Select Location
hi: स्थान चुनें

source: Select
hi: चुनें

source: Continue
hi: जारी रखें

source: Groundwater Status
hi: भूजल की स्थिति

source: Village/Town
hi: गाँव/कस्बा

source: Water Level (m bgl)
hi: जल स्तर (मीटर बीजीएल)

source: Status
hi: स्थिति

source: Safe
hi: सुरक्षित

source: Water Quality
hi: जल की गुणवत्ता

source: Water Quality Status
hi: जल गुणवत्ता की स्थिति

source: Not Safe
hi: असुरक्षित

source: Fluoride
hi: फ्लोराइड

source: Nitrate
hi: नाइट्रेट

source: Arsenic
hi: आर्सेनिक

source: Iron
hi: लोहा

source: EC (Salinity)
hi: ईसी (लवणता)

source: Read More →
hi: और पढ़ें →

source: Rainwater Harvesting: Smart Farming Wisdom 💧
hi: वर्षा जल संचयन: स्मार्ट खेती की समझ 💧

source: Rainwater Harvesting: Smart Farming Wisdom
hi: वर्षा जल संचयन: स्मार्ट खेती की समझ

source: Calculate Your Savings with Rainwater Harvesting
hi: वर्षा जल संचयन के साथ अपनी बचत की गणना करें

source: Calculate Your Savings by Using Water Harvesting
hi: वर्षा जल संचयन से अपनी बचत की गणना करें

source: Rooftop Area (sq.m)
hi: छत का क्षेत्रफल (वर्ग मीटर)

source: Annual Rainfall (mm)
hi: वार्षिक वर्षा (मिमी)

source: Surface Type
hi: सतह का प्रकार

source: Concrete
hi: कंक्रीट

source: Tile
hi: टाइल

source: Soil
hi: मिट्टी

source: Water Rate (₹/KL)
hi: पानी की दर (₹/किलोलीटर)

source: Calculate
hi: गणना करें

source: Estimated Harvested Water:
hi: अनुमानित संचयित जल:

source: KL
hi: किलोलीटर

source: Estimated Cost Savings:
hi: अनुमानित लागत बचत:

source: What Rainwater Harvesting Is
hi: वर्षा जल संचयन क्या है

source: Rainwater harvesting (RWH), in farmer’s lingo, means catching rain when it falls on your fields, roofs, or sheds, and storing it for later use—either directly in ponds, farm bunds, underground tanks, or into the ground for recharging borewells. It’s like filling up your water tank during the rains so you’ve got a backup when skies turn dry. Simple, yet it works wonders for irrigation, livestock, and even domestic chores on the farm.
hi: किसानों की भाषा में वर्षा जल संचयन (RWH) का मतलब है बारिश को जब यह आपके खेतों, छतों या शेड्स पर गिरती है, उसे पकड़ना और बाद में उपयोग के लिए स्टोर करना—या तो सीधे तालाबों, खेत के बांधों, भूमिगत टैंकों में या भूमिगत जल स्तर को पुनः भरण के लिए। यह ऐसा है जैसे आप बारिश के मौसम में अपने जल टैंक को भर लेते हैं ताकि सूखे मौसम में पानी की आपूर्ति बनी रहे। सरल है, लेकिन सिंचाई, पशुपालन और घरेलू कामों में कमाल करता है।

source: Types of RWH:
hi: वर्षा जल संचयन के प्रकार:

source: Roof water harvesting: Simple gutters and filters divert water from shed roofs into plastic/poly tanks or recharge pits. Farmers often call them “tapri tanks” or “underground sump” in local terms.
hi: छत का जल संचयन: सरल नालियां और फिल्टर्स शेड की छत से पानी को प्लास्टिक/पॉली टैंकों या पुनर्भरण गड्ढों में मोड़ते हैं। किसान इन्हें स्थानीय रूप से “टपरी टैंक” या “भूमिगत समप” कहते हैं।

source: Field bunding & contour trenches: Using tractors or cattle-led ploughing, bunds are built along slopes to hold rain, giving it time to soak in rather than run off.
hi: खेत के बांध और कंटूर खाइयां: ट्रैक्टर या पशुओं द्वारा जुताई करते हुए, ढलानों के साथ बांध बनाकर बारिश को रोकते हैं ताकि पानी जमीं में समा सके न कि बह जाए।

source: Farm ponds/johads: Dug-out pits (traditional johads) catch and store surplus rainwater—used later to irrigate fields or water livestock. In Haryana and Rajasthan, johads act like on-farm reservoirs.
hi: खेत के तालाब/जोहड़: खोदे गए गड्ढे (पारंपरिक जोहड़) अतिरिक्त वर्षा जल पकड़ते हैं—जो बाद में खेतों की सिंचाई या पशुओं को पानी देने के लिए उपयोग होता है। हरियाणा और राजस्थान में जोहड़ खेत के जलाशयों की तरह काम करते हैं।

source: Recharge shafts and pits: These are drilled near the bund or under sheds to help rain soak down, strengthening groundwater reserves.
hi: पुनर्भरण शाफ्ट और गड्ढे: ये बांध के पास या शेड के नीचे खोदे जाते हैं ताकि बारिश जमीन में समा सके और भूजल स्तर मजबूत हो।

source: On-Farm Benefits:
hi: खेत में लाभ:

source: Boosts soil moisture: Trench and bund systems reduce runoff, so moisture lingers longer in your field.
hi: मिट्टी की नमी बढ़ाता है: खाइयां और बांध बहाव कम करते हैं, जिससे नमी आपके खेत में अधिक समय तक बनी रहती है।

source: Improves crop yields: Water stays longer in the root zone—less stress on late-sown crops.
hi: फसल की पैदावार बढ़ाता है: पानी जड़ क्षेत्र में अधिक समय रहता है—देर से बोई फसलों पर कम तनाव।

source: Lowers pumping costs: Groundwater stays recharged, reducing the number of hours you run tubewells.
hi: पंपिंग लागत कम करता है: भूजल पुनः भरा रहता है, जिससे ट्यूबवेल चलाने के घंटे कम हो जाते हैं।

source: Reduces soil erosion: Bunds hold back topsoil; trenches slow water, saving your precious earth.
hi: मिट्टी के कटाव को कम करता है: बांध ऊपरी मिट्टी को रोकते हैं; खाइयां पानी की गति कम करती हैं, जिससे आपकी मिट्टी बचती है।

source: Farm resilience in dry spells: Even a short dry spell won’t destroy your crop if the soil still has some moisture stored.
hi: सूखे मौसम में खेत की मजबूती: यदि मिट्टी में कुछ नमी बची है तो छोटा सूखा भी आपकी फसल को नुकसान नहीं पहुंचा पाएगा।

source: For farmers across Haryana and Punjab, rainwater harvesting isn’t some foreign tech—it’s farm smarts. It’s just about working with the land you’ve got, catching what nature gives, and saving every drop.
hi: हरियाणा और पंजाब के किसानों के लिए वर्षा जल संचयन कोई विदेशी तकनीक नहीं है—यह खेती की समझ है। यह बस उस जमीन के साथ काम करने का तरीका है जो आपके पास है, जो प्रकृति देती है उसे पकड़ना और हर बूंद बचाना।

source: Why Rainwater Harvesting Is Important
hi: वर्षा जल संचयन क्यों महत्वपूर्ण है

source: If you ask any experienced farmer in Haryana or Punjab, they’ll tell you directly:
hi: यदि आप हरियाणा या पंजाब के किसी अनुभवी किसान से पूछें, तो वे सीधे कहेंगे:

source: Without water, the farm dies.
hi: पानी के बिना, खेत मर जाता है।

source: That’s why rainwater harvesting (RWH) is not just a good idea — it’s a necessity.
hi: इसीलिए वर्षा जल संचयन (RWH) सिर्फ एक अच्छा विचार नहीं है — यह एक आवश्यकता है।

source: Especially in places like Karnal, where farmers in the video say:
hi: विशेष रूप से करनाल जैसे स्थानों में, जहां वीडियो में किसान कहते हैं:

source: Before, water was available year-round; now even three months is hard.
hi: पहले, पानी साल भर उपलब्ध था; अब तीन महीने भी मुश्किल हैं।

source: Groundwater Tube-Wells Drying Up
hi: भूजल ट्यूब-वेल सूख रहे हैं

source: In the first three minutes of the Karnal farmer’s video, he mentions:
hi: करनाल किसान के वीडियो के पहले तीन मिनट में, वह बताते हैं:

source: Even a 500 ft borewell failed.
hi: यहां तक कि 500 फीट का बोरवेल भी फेल हो गया।

source: Farmers in Haryana rely heavily on borewells. But borewell water isn’t unlimited — if the underground water table isn’t recharged, it finishes.
hi: हरियाणा के किसान बोरवेल पर भारी निर्भर करते हैं। लेकिन बोरवेल का पानी अनंत नहीं है — यदि भूमिगत जल स्तर पुनः नहीं भरा गया, तो पानी खत्म हो जाता है।

source: Rainwater harvesting helps recharge the aquifer. When rainwater seeps down through pits and trenches, it fills up those empty spaces underground that borewells tap into.
hi: वर्षा जल संचयन जलभृत को पुनः भरने में मदद करता है। जब वर्षा जल गड्ढों और खाइयों से नीचे रिसता है, तो यह उन खाली जगहों को भर देता है जिनसे बोरवेल पानी निकालते हैं।

source: Without recharge, you’ll find yourself calling JCB operators again and again:
hi: बिना पुनर्भरण के, आपको बार-बार जेसीबी ऑपरेटर बुलाना पड़ेगा:

source: Dig me another borewell — costing thousands, and there’s still no guarantee of water.
hi: मुझे एक और बोरवेल खोद दो — हजारों की लागत पर, और फिर भी पानी की कोई गारंटी नहीं।

source: Crops Suffer in Dry Spells
hi: सूखे मौसम में फसलें प्रभावित होती हैं

source: A farmer says in the video:
hi: वीडियो में एक किसान कहते हैं:

source: Two days without rain and the crop is ruined.
hi: दो दिन बिना बारिश के और फसल खराब हो जाती है।

source: Especially for paddy, wheat, or sugarcane, water at the right stage is crucial.
hi: विशेषकर धान, गेहूं, या गन्ने के लिए सही समय पर पानी बहुत जरूरी है।

source: RWH means when there is a 5–10 day dry spell, there’s still water in your bunds, ponds, or recharge pit helping the soil retain moisture.
hi: RWH का मतलब है कि जब 5-10 दिन का सूखा हो, तब भी आपके बांधों, तालाबों या पुनर्भरण गड्ढों में पानी होता है जो मिट्टी को नमी बनाए रखने में मदद करता है।

source: Even in cotton or pulses, soil moisture from RWH bunds keeps roots cool and hydrated.
hi: साधारण कपास या दालों में भी, RWH बांधों से मिट्टी की नमी जड़ों को ठंडा और हाइड्रेटेड रखती है।

source: Saving Fertile Soil
hi: उपजाऊ मिट्टी की रक्षा

source: Without rainwater control, what happens?
hi: वर्षा जल नियंत्रण के बिना क्या होता है?

source: Runoff.
hi: बहाव।

source: Soil washes away, along with the fertilizer.
hi: मिट्टी और उर्वरक दोनों बह जाते हैं।

source: When rain hits hard and there’s no bund or trench, topsoil — the most fertile layer — goes into drains.
hi: जब बारिश तेज होती है और कोई बांध या खाई नहीं होती, तो सबसे उपजाऊ मिट्टी नालियों में चली जाती है।

source: Farmers lose both seed-bed quality and money spent on urea, DAP, and potash.
hi: किसान बीज बिस्तर की गुणवत्ता और यूरिया, डीएपी, पोटाश पर खर्च किया गया पैसा दोनों खो देते हैं।

source: RWH bunding stops that. Water is slowed down, giving it time to sink into the field while holding the soil in place.
hi: RWH बांध इसे रोकते हैं। पानी की गति धीमी हो जाती है, जिससे यह खेत में समा जाता है और मिट्टी वहीं बनी रहती है।

source: Cost Cutting — Less Diesel, Less Electricity
hi: लागत कम करना — कम डीजल, कम बिजली

source: Less borewell use: If your groundwater is topped up naturally, you won’t have to run diesel pumps or electric tubewells as much.
hi: कम बोरवेल उपयोग: यदि आपका भूजल प्राकृतिक रूप से भर जाता है, तो आपको डीजल पंप या इलेक्ट्रिक ट्यूबवेल कम चलाने पड़ेंगे।

source: One Karnal farmer says:
hi: एक करनाल किसान कहते हैं:

source: Electric bill cut in half after making bunds and pits.
hi: बांध और गड्ढे बनाने के बाद बिजली का बिल आधा हो गया।

source: Even livestock water needs — cows, buffaloes, goats — can be handled by stored rainwater in farm ponds.
hi: पशुधन की पानी की जरूरतें — गाय, भैंस, बकरी — भी खेत के तालाबों में जमा वर्षा जल से पूरी हो सकती हैं।

source: Future Proofing the Farm
hi: खेत का भविष्य सुरक्षित करना

source: With climate change, monsoon patterns are shifting. Sometimes rains come early, sometimes late. Sometimes all in one shot.
hi: जलवायु परिवर्तन के साथ, मानसून के पैटर्न बदल रहे हैं। कभी बारिश जल्दी आती है, कभी देर से। कभी एक बार में सारी बारिश होती है।

source: Smart farmers think ahead:
hi: समझदार किसान आगे सोचते हैं:

source: Who saves water today will save the farm tomorrow.
hi: जो आज पानी बचाता है, कल खेत बचाएगा।

source: That’s why rainwater harvesting is part of government advisories now. Even PMKSY (Pradhan Mantri Krishi Sinchayee Yojana) supports it.
hi: इसीलिए वर्षा जल संचयन अब सरकारी सलाहों का हिस्सा है। पीएमकेएसवाई (प्रधान मंत्री कृषि सिंचाई योजना) भी इसे समर्थन देती है।

source: Visit: <a href="https://pmksy.gov.in/" target="_blank">https://pmksy.gov.in/</a>
hi: देखें: <a href="https://pmksy.gov.in/" target="_blank">https://pmksy.gov.in/</a>

source: How to Do Rainwater Harvesting
hi: वर्षा जल संचयन कैसे करें

source: Understand Your Land and Water Flow
hi: अपने खेत और जल प्रवाह को समझें

source: Before a farmer can save rainwater, it’s important to understand how rain behaves on their own farm. The first rain of the season is like nature’s inspection. Go out in the field, watch where water runs off fast, where it stands, and where it disappears into the soil. These low points, slopes, and drainage paths show you exactly where bunds, trenches, ponds, or recharge pits will be most effective.
hi: किसान वर्षा जल बचाने से पहले यह समझना जरूरी है कि बारिश उनके खेत पर कैसे बरसती है। मौसम की पहली बारिश प्रकृति की जाँच की तरह होती है। खेत में जाकर देखें कि पानी कहाँ तेजी से बहता है, कहाँ रुकता है, और कहाँ मिट्टी में समा जाता है। ये नीचले स्थान, ढलान और जल निकासी मार्ग आपको बताएंगे कि बांध, खड्ड, तालाब या पुनर्भरण गड्ढे कहाँ सबसे प्रभावी होंगे।

source: Many farmers think harvesting water means building big tanks only, but real harvesting starts with knowing your land first.
hi: कई किसान सोचते हैं कि जल संचयन केवल बड़े टैंकों का निर्माण है, लेकिन असली संचयन अपनी जमीन को समझने से शुरू होता है।

source: Choosing the Right Method for Your Farm Size
hi: अपने खेत के आकार के लिए सही तरीका चुनना

source: Small farms (up to 2 acres):
hi: छोटे खेत (2 एकड़ तक):

source: Field bunding, small recharge pits, and roof water harvesting.
hi: फील्ड बांध, छोटे पुनर्भरण गड्ढे, और छत से जल संचयन।

source: Medium farms (2–5 acres):
hi: मध्यम खेत (2 से 5 एकड़):

source: Contour trenches, medium-sized farm ponds, and recharge shafts.
hi: ढलान खड्ड, मध्यम आकार के खेत तालाब, और पुनर्भरण शाफ्ट।

source: Large farms (5+ acres):
hi: बड़े खेत (5 एकड़ से अधिक):

source: Full setups with bunding, large ponds, multiple recharge pits, even check dams if there’s a village drain or nallah nearby.
hi: पूरी व्यवस्था जैसे बांध बनाना, बड़े तालाब, कई पुनर्भरण गड्ढे, और यदि आसपास गांव की नाली या नाला हो तो चेक डैम।

source: The rule is simple:
hi: नियम सरल है:

source: Jitna zyada zameen, utni zyada jagah paani rokne ki.
hi: जितनी ज्यादा ज़मीन, उतनी ज्यादा जगह पानी रोकने की।

source: The more land you have, the more places to stop the water.
hi: जितनी अधिक ज़मीन होगी, पानी रोकने के उतने ही ज्यादा स्थान होंगे।

source: Building Bunds, Trenches, and Ponds
hi: बांध, खड्ड, और तालाब बनाना

source: Bunds should be built across the slope using a tractor or manually, about 1–1.5 feet high. This slows water down and allows the soil to soak it in. Along with bunds, dig trenches 1.5–2 feet wide and deep, filled partially with sand or gravel.
hi: ढलान के across ट्रैक्टर या हाथ से 1–1.5 फीट ऊंचे बांध बनाए जाएं। यह पानी की गति धीमी करता है और मिट्टी को सोखने देता है। बांधों के साथ 1.5–2 फीट चौड़े और गहरे खड्ड खोदें, जिनमें आंशिक रूप से रेत या बजरी भरी हो।

source: Farm ponds are dug where water naturally collects. Even a simple pond of 20–40 feet long, 15–20 feet wide, and 5–7 feet deep can store thousands of litres of water. If lined with plastic or cow dung–clay mix, seepage loss is reduced. Farmers in Haryana say this is enough for livestock water and emergency crop irrigation for several weeks.
hi: खेत तालाब ऐसे स्थान पर खोदे जाते हैं जहां पानी प्राकृतिक रूप से इकट्ठा होता है। एक साधारण तालाब जो 20–40 फीट लंबा, 15–20 फीट चौड़ा और 5–7 फीट गहरा हो, हजारों लीटर पानी संग्रहित कर सकता है। अगर प्लास्टिक या गोबर-मिट्टी मिश्रण से लाइन किया जाए तो रिसाव कम होता है। हरियाणा के किसान कहते हैं कि यह पशुओं के पानी और आपातकालीन सिंचाई के लिए कई हफ्तों तक पर्याप्त है।

source: Saving Estimate:
hi: बचत का अनुमान:

source: One medium-sized pond can save farmers ₹20,000–₹40,000 per year in diesel and electricity costs by reducing borewell usage. Plus, water saved from runoff keeps crops alive in dry spells, preventing total crop loss which could mean lakhs of rupees in avoided loss.
hi: एक मध्यम आकार का तालाब किसानों को प्रति वर्ष ₹20,000–₹40,000 तक डीजल और बिजली की लागत बचा सकता है, क्योंकि यह ट्यूबवेल के उपयोग को कम करता है। इसके अलावा, जल संचयन से सूखे के दौरान फसलें जीवित रहती हैं, जिससे लाखों रुपये के नुकसान से बचा जा सकता है।

source: Roof Water Harvesting for Home and Shed Water
hi: घर और आश्रय के लिए छत से जल संचयन

source: Installing gutters along tin-roofed cattle sheds, homes, or storage rooms is cheap but powerful. Collect that rainwater through filters (sand, gravel, charcoal) into tanks or recharge pits.
hi: टिन छत वाले पशुशालाओं, घरों या स्टोर रूम के साथ गटर लगाना सस्ता लेकिन प्रभावी है। उस वर्षा जल को रेत, बजरी, और चारकोल फिल्टर के माध्यम से टैंकों या पुनर्भरण गड्ढों में इकट्ठा करें।

source: In a 500 sq. ft. roof area, farmers can collect up to 25,000–30,000 litres of water per season. That’s enough for household use, animal needs, or recharge support.
hi: 500 वर्ग फुट छत क्षेत्र में, किसान प्रति सीजन 25,000–30,000 लीटर पानी जमा कर सकते हैं। यह घरेलू उपयोग, पशुओं की जरूरत या पुनर्भरण सहायता के लिए पर्याप्त है।

source: Recharge Pits for Borewell Health
hi: ट्यूबवेल की सेहत के लिए पुनर्भरण गड्ढे

source: Every borewell eventually dries out if there’s no recharge. By digging 4–6 feet deep pits near your tubewell, filled with gravel and sand, you allow water to reach down exactly where needed. This saves the extra ₹50,000–₹1,00,000 borewell deepening cost farmers face every 3–4 years.
hi: यदि पुनर्भरण नहीं होता है तो हर ट्यूबवेल अंततः सूख जाता है। अपने ट्यूबवेल के पास 4–6 फीट गहरे गड्ढे खोदकर, जिन्हें बजरी और रेत से भरा जाता है, आप पानी को सही जगह तक पहुंचने देते हैं। इससे हर 3–4 साल में ट्यूबवेल गहरा करने की ₹50,000–₹1,00,000 की अतिरिक्त लागत बचती है।

source: Maintaining the System
hi: प्रणाली का रख-रखाव

source: Water harvesting is not just about building once and forgetting. Farmers must clean roof filters before each monsoon, de-silt ponds once a year, and fix bund cracks quickly.
hi: जल संचयन केवल एक बार बनाकर भूल जाने की बात नहीं है। किसानों को हर मानसून से पहले छत के फिल्टर साफ करने चाहिए, तालाबों की साल में एक बार सफाई करनी चाहिए, और बांध के दरारों को जल्दी ठीक करना चाहिए।

source: If maintained well, these structures work for 10–15 years without major repair costs.
hi: अगर अच्छी तरह से रख-रखाव किया जाए, तो ये संरचनाएँ बिना बड़ी मरम्मत लागत के 10–15 साल तक काम करती हैं।

source: Why It’s Worth It: A Farmer’s Motivation
hi: क्यों यह लाभकारी है: एक किसान की प्रेरणा

source: Every drop of rain that leaves your land is lost income. Diesel, electricity, fertilizers — everything depends on water. Farmers who set up rainwater harvesting save ₹40,000–₹1,00,000 per year minimum through:
hi: आपके खेत से निकलने वाली हर बूंद बारिश खोई हुई आमदनी है। डीजल, बिजली, उर्वरक — सब पानी पर निर्भर है। जो किसान वर्षा जल संचयन करते हैं वे प्रति वर्ष कम से कम ₹40,000–₹1,00,000 बचाते हैं, इसके द्वारा:

source: Less borewell diesel cost
hi: कम ट्यूबवेल डीजल लागत

source: Less fertilizer washing away
hi: कम उर्वरक का बह जाना

source: Avoiding crop failure during dry spells
hi: सूखे के दौरान फसल नुकसान से बचाव

source: More than the money, it’s about control.
hi: पैसे से ज्यादा, यह नियंत्रण की बात है।

source: When farmers save water on their land, they’re not waiting for the government, panchayat, or weather gods.
hi: जब किसान अपने खेत पर पानी बचाते हैं, तो वे सरकार, पंचायत या मौसम देवताओं का इंतजार नहीं करते।

source: This isn’t some modern city idea — it’s traditional farming wisdom, just adapted for today’s needs.
hi: यह कोई आधुनिक शहर की सोच नहीं है — यह पारंपरिक खेती की समझ है, जो आज की जरूरतों के अनुसार ढाली गई है।

source: Once a farmer has set up rainwater harvesting on their land, the next smart step is using that saved water wisely. Water alone does not guarantee a successful crop. It is about how, when, and where the water is used, along with other modern farming practices. In today’s time, with rising costs of fertilizers, diesel, and labour, smart farming means getting maximum output with minimum wastage.
hi: जब कोई किसान अपने खेत में वर्षा जल संचयन स्थापित कर लेता है, तो अगला समझदारी भरा कदम होता है उस जमा पानी का समझदारी से उपयोग करना। केवल पानी होना फसल की सफलता की गारंटी नहीं है। यह इस बात पर निर्भर करता है कि पानी कब, कहाँ और कैसे उपयोग किया जाता है, साथ ही अन्य आधुनिक खेती के तरीकों पर भी। आज के समय में, उर्वरक, डीजल और मजदूरी की बढ़ती लागत के साथ, स्मार्ट खेती का मतलब है कम से कम बर्बादी के साथ अधिकतम उपज पाना।

source: Combining Rainwater Harvesting with Drip and Sprinkler Systems
hi: वर्षा जल संचयन को ड्रिप और स्प्रिंकलर सिस्टम के साथ जोड़ना

source: The first and most effective smart farming step is using drip irrigation and sprinkler systems. Drip systems deliver water directly to the root zone of plants. Even if you have stored water from rainwater harvesting in a farm pond or recharge pit, using it through drip ensures that not even one drop is wasted.
hi: स्मार्ट खेती का पहला और सबसे प्रभावी कदम है ड्रिप सिंचाई और स्प्रिंकलर सिस्टम का उपयोग। ड्रिप सिस्टम पौधों की जड़ों तक सीधे पानी पहुंचाते हैं। भले ही आपके पास खेत तालाब या पुनर्भरण गड्ढे में जमा वर्षा जल हो, ड्रिप के माध्यम से इसका उपयोग यह सुनिश्चित करता है कि एक बूंद भी व्यर्थ न हो।

source: Many farmers combine these systems with their ponds. Water is pumped from the pond into the drip lines, cutting down dependency on borewell pumping.
hi: कई किसान इन सिस्टम को अपने तालाबों के साथ जोड़ते हैं। पानी तालाब से ड्रिप लाइनों में पंप किया जाता है, जिससे ट्यूबवेल पंपिंग पर निर्भरता कम हो जाती है।

source: Timing Your Irrigation with Weather Awareness
hi: मौसम की जानकारी के साथ सिंचाई का समय निर्धारित करना

source: Another smart practice is not irrigating blindly. Farmers should keep track of weather forecasts. Many free mobile apps now show upcoming rain predictions. By checking before starting irrigation, farmers can avoid overwatering. This saves water, diesel, and prevents fertilizer wash-off.
hi: एक और स्मार्ट तरीका है बिना सोचे-समझे सिंचाई न करना। किसानों को मौसम पूर्वानुमान पर नजर रखनी चाहिए। कई मुफ्त मोबाइल ऐप अब आने वाली बारिश की जानकारी देते हैं। सिंचाई शुरू करने से पहले जांच कर किसान पानी की अधिकता से बच सकते हैं। इससे पानी, डीजल बचता है और उर्वरक का बहना भी रुकता है।

source: For example, if rain is expected in 2–3 days, farmers can skip one irrigation round and let the rain do the job naturally.
hi: उदाहरण के लिए, अगर 2–3 दिनों में बारिश होने की संभावना हो, तो किसान एक बार सिंचाई छोड़ सकते हैं और बारिश को प्राकृतिक रूप से काम करने दें।

source: Using Mulching to Preserve Moisture
hi: मिट्टी की नमी बनाए रखने के लिए मल्चिंग का उपयोग

source: Even small farmers growing vegetables like tomatoes, cucumbers, or chillies can use mulch for better results using their harvested rainwater.
hi: छोटे किसान भी टमाटर, खीरा, या मिर्च जैसी सब्जियां उगाते हुए बेहतर परिणामों के लिए अपने जमा वर्षा जल के साथ मल्चिंग कर सकते हैं।

source: Crop Planning According to Water Availability
hi: पानी की उपलब्धता के अनुसार फसल योजना बनाना

source: Farmers practicing smart farming don’t just grow what everyone else is growing. They check how much water is available from rainwater harvesting and then choose crops accordingly.
hi: स्मार्ट खेती करने वाले किसान केवल वही फसल नहीं उगाते जो सब उगा रहे हैं। वे जांचते हैं कि वर्षा जल संचयन से कितना पानी उपलब्ध है और उसके अनुसार फसल चुनते हैं।

source: Farmers with small ponds may focus on vegetables or pulses that need less water.
hi: छोटे तालाब वाले किसान कम पानी वाली सब्जियां या दालों पर ध्यान दे सकते हैं।
